# Лабораторная работа - Настройка DHCPv6

**Выполнил Давыдкин Д.Г.**

------------
### Топология

![Image]()


### Таблица адресации

| Устройство  | Интерфейс  | IPv6 адреса  |
|---|---|---|
|   |   | 2001:db8:acad:2::1 /64  |
|   |   | fe80::1  |
|   |   |2001:db8:acad:1::1/64  |
|   |   | fe80::1  |
|   |   | 2001:db8:acad:2::2/64  |
|   |   |  fe80::2 |
|   |   | 2001:db8:acad:3::1 /64  |
|   |   | fe80::1  |
|   |   |  DHCP |
|   |   | DHCP  |

### Задачи
Часть 1. Создание сети и настройка основных параметров устройства.

Часть 2. Проверка назначения адреса от R1 с помощью SLAAC.

Часть 3.  Настройка и проверка DHCPv6 сервера без поддержки сохранения состояния на R1.

Часть 4.  Настройка и проверка DHCPv6 сервера C поддержкой сохранения состояния на R1.

Часть 5.  Настройка и проверка DHCPv6 Relay для R2.

### Часть 1. Создание сети и настройка основных параметров устройства.

*Шаг 1. Подключите сеть согласно топологии.

![Image]()

*Щаг 2. Выполните базовые настройки на каждом коммутаторе.*

*Шаг 3. Выполните базовые настройки на каждом маршрутизаторе.*

*Шаг 4. Настройте интерфейсы и маршрутизацию на каждом маршрутизаторе*

### Часть 2. Проверка назначения адреса от R1 с помощью SLAAC.

Во второй части необхбодимо проверить получение хостом PC-A IPv6 адреса методом SLAA

![Image]()

### Часть 3. Настройка и проверка DHCPv6 сервера без поддержки сохранения состояния на R1.

*Шаг 1. Изучите более подробно конфигурацию хоста PC-A.

a) ![Image]()


*Шаг 2. Настройка R1 для предоставления DHCPv6 PC-A без сохранения состояния.*

*a) Создайте IPv6 DHCP пул на R1 с названием R1-STATELESS. В качестве DNS сервера для данного пула назначьте адрес 2001:db8:acad::1 и доменное имя STATELESS.com.*

R1(config)# ipv6 dhcp pool R1-STATELESS

R1(config-dhcp)# dns-server 2001:db8:acad::254

R1(config-dhcp)# domain-name STATELESS.com

*b) Настройте интерфейс __ на R1 чтобы предоставленть флаг конфигурации OTHER для локальной сети R1 и укажите только что созданный пул DHCP в качестве ресурса DHCP для этого интерфейса.*

R1(config)# interface g0/0/1

R1(config-if)# ipv6 nd other-config-flag

R1(config-if)# ipv6 dhcp server R1-STATELESS

*c) Сохраните конфигурацию в startup-config.*

d) Перезагрузите хост PC-A/

e) Выполните команду ipconfig /all

![Image]()

*) Проверьте подключение с помощью команды пинг на адрес интерфейса ___ маршрутизатора R2.*

![Image]()

### Часть 4.  Настройка и проверка DHCPv6 сервера C поддержкой сохранения состояния на R1.


*Создайте пул DHCPv6 на маршрутизаторе R1 для сети 2001:db8:acad:3:aaaa::/80. Это предоставит адреса для локальной сети, подключенной к интерфейсу G0/0/1 на маршрутизаторе R2. Как часть пула, установите DNS-сервер на 2001:db8:acad::254 и задайте доменное имя STATEFUL.com.*

R1(config)# ipv6 dhcp pool R2-STATEFUL

R1(config-dhcp)# address prefix 2001:db8:acad:3:aaa::/80

R1(config-dhcp)# dns-server 2001:db8:acad::254

R1(config-dhcp)# domain-name STATEFUL.com

*b) Назначьте созданный пул на интерфейс ___ маршрутизатора R1.*

### Часть 5.  Настройка и проверка DHCPv6 Relay для R2.

*Шаг 1.Включите компьютер PC-B и проверьте сгенерированный им адрес SLAAC.*

*Шаг 2.Настройте R2 в качестве агента ретрансляции DHCP для локальной сети на G0/0/1.*

a) Нстройте команду ipv6 dhcp relay на интерфейсе R2 G0/0/1, указав адрес назначения интерфейса G0/0/0 на R1. Также настройте команду manage-config-flag.

R2(config)# interface g0/0/1

R2(config-if)# ipv6 nd managed-config-flag

R2(config-if)# ipv6 dhcp relay destination 2001:db8:acad:2::1 g0/0/0

b) Сохраните конфигурацию.

*Шаг 3.Попытайтесь получить IPv6-адрес от DHCPv6 PC-B.

a) Перезагрузите PC-B

b) Откройте командную строку на ПК-B, введите команду ipconfig /all и просмотрите выходные данные, чтобы увидеть результаты работы ретранслятора DHCPv6.

![Image]()

c) Проверить подключение с помощью команды PING на адрес интерфейса ____.



